Microchip-MPLAB-Harmony/reference_apps/apps/sam_e51_cnano/same51n_getting_started/firmware/src/packs/ATSAME51J20A_DFP/component/sdhc.h
#define SDHC_BCR_BCNT_Pos                     _U_(0)                                               /**< (SDHC_BCR) Blocks Count for Current Transfer Position */
#define SDHC_BCR_BCNT_Msk                     (_U_(0xFFFF) << SDHC_BCR_BCNT_Pos)                   /**< (SDHC_BCR) Blocks Count for Current Transfer Mask */
#define SDHC_BCR_BCNT(value)                  (SDHC_BCR_BCNT_Msk & ((value) << SDHC_BCR_BCNT_Pos))
#define SDHC_BCR_Msk                          _U_(0xFFFF)                                          /**< (SDHC_BCR) Register Mask  */


/* -------- SDHC_ARG1R : (SDHC Offset: 0x08) (R/W 32) Argument 1 -------- */
#define SDHC_ARG1R_RESETVALUE                 _U_(0x00)                                            /**<  (SDHC_ARG1R) Argument 1  Reset Value */

#define SDHC_ARG1R_ARG_Pos                    _U_(0)                                               /**< (SDHC_ARG1R) Argument 1 Position */
#define SDHC_ARG1R_ARG_Msk                    (_U_(0xFFFFFFFF) << SDHC_ARG1R_ARG_Pos)              /**< (SDHC_ARG1R) Argument 1 Mask */
#define SDHC_ARG1R_ARG(value)                 (SDHC_ARG1R_ARG_Msk & ((value) << SDHC_ARG1R_ARG_Pos))
#define SDHC_ARG1R_Msk                        _U_(0xFFFFFFFF)                                      /**< (SDHC_ARG1R) Register Mask  */


/* -------- SDHC_TMR : (SDHC Offset: 0x0C) (R/W 16) Transfer Mode -------- */
#define SDHC_TMR_RESETVALUE                   _U_(0x00)                                            /**<  (SDHC_TMR) Transfer Mode  Reset Value */

#define SDHC_TMR_DMAEN_Pos                    _U_(0)                                               /**< (SDHC_TMR) DMA Enable Position */
#define SDHC_TMR_DMAEN_Msk                    (_U_(0x1) << SDHC_TMR_DMAEN_Pos)                     /**< (SDHC_TMR) DMA Enable Mask */
#define SDHC_TMR_DMAEN(value)                 (SDHC_TMR_DMAEN_Msk & ((value) << SDHC_TMR_DMAEN_Pos))
#define   SDHC_TMR_DMAEN_DISABLE_Val          _U_(0x0)                                             /**< (SDHC_TMR) No data transfer or Non DMA data transfer  */
#define   SDHC_TMR_DMAEN_ENABLE_Val           _U_(0x1)                                             /**< (SDHC_TMR) DMA data transfer  */
#define SDHC_TMR_DMAEN_DISABLE                (SDHC_TMR_DMAEN_DISABLE_Val << SDHC_TMR_DMAEN_Pos)   /**< (SDHC_TMR) No data transfer or Non DMA data transfer Position  */
#define SDHC_TMR_DMAEN_ENABLE                 (SDHC_TMR_DMAEN_ENABLE_Val << SDHC_TMR_DMAEN_Pos)    /**< (SDHC_TMR) DMA data transfer Position  */
#define SDHC_TMR_BCEN_Pos                     _U_(1)                                               /**< (SDHC_TMR) Block Count Enable Position */
#define SDHC_TMR_BCEN_Msk                     (_U_(0x1) << SDHC_TMR_BCEN_Pos)                      /**< (SDHC_TMR) Block Count Enable Mask */
#define SDHC_TMR_BCEN(value)                  (SDHC_TMR_BCEN_Msk & ((value) << SDHC_TMR_BCEN_Pos))
#define   SDHC_TMR_BCEN_DISABLE_Val           _U_(0x0)                                             /**< (SDHC_TMR) Disable  */
#define   SDHC_TMR_BCEN_ENABLE_Val            _U_(0x1)                                             /**< (SDHC_TMR) Enable  */
#define SDHC_TMR_BCEN_DISABLE                 (SDHC_TMR_BCEN_DISABLE_Val << SDHC_TMR_BCEN_Pos)     /**< (SDHC_TMR) Disable Position  */
#define SDHC_TMR_BCEN_ENABLE                  (SDHC_TMR_BCEN_ENABLE_Val << SDHC_TMR_BCEN_Pos)      /**< (SDHC_TMR) Enable Position  */
#define SDHC_TMR_ACMDEN_Pos                   _U_(2)                                               /**< (SDHC_TMR) Auto Command Enable Position */
#define SDHC_TMR_ACMDEN_Msk                   (_U_(0x3) << SDHC_TMR_ACMDEN_Pos)                    /**< (SDHC_TMR) Auto Command Enable Mask */
#define SDHC_TMR_ACMDEN(value)                (SDHC_TMR_ACMDEN_Msk & ((value) << SDHC_TMR_ACMDEN_Pos))
#define   SDHC_TMR_ACMDEN_DISABLED_Val        _U_(0x0)                                             /**< (SDHC_TMR) Auto Command Disabled  */
#define   SDHC_TMR_ACMDEN_CMD12_Val           _U_(0x1)                                             /**< (SDHC_TMR) Auto CMD12 Enable  */
#define   SDHC_TMR_ACMDEN_CMD23_Val           _U_(0x2)                                             /**< (SDHC_TMR) Auto CMD23 Enable  */
#define SDHC_TMR_ACMDEN_DISABLED              (SDHC_TMR_ACMDEN_DISABLED_Val << SDHC_TMR_ACMDEN_Pos) /**< (SDHC_TMR) Auto Command Disabled Position  */
#define SDHC_TMR_ACMDEN_CMD12                 (SDHC_TMR_ACMDEN_CMD12_Val << SDHC_TMR_ACMDEN_Pos)   /**< (SDHC_TMR) Auto CMD12 Enable Position  */
#define SDHC_TMR_ACMDEN_CMD23                 (SDHC_TMR_ACMDEN_CMD23_Val << SDHC_TMR_ACMDEN_Pos)   /**< (SDHC_TMR) Auto CMD23 Enable Position  */
#define SDHC_TMR_DTDSEL_Pos                   _U_(4)                                               /**< (SDHC_TMR) Data Transfer Direction Selection Position */
#define SDHC_TMR_DTDSEL_Msk                   (_U_(0x1) << SDHC_TMR_DTDSEL_Pos)                    /**< (SDHC_TMR) Data Transfer Direction Selection Mask */
#define SDHC_TMR_DTDSEL(value)                (SDHC_TMR_DTDSEL_Msk & ((value) << SDHC_TMR_DTDSEL_Pos))
#define   SDHC_TMR_DTDSEL_WRITE_Val           _U_(0x0)                                             /**< (SDHC_TMR) Write (Host to Card)  */
#define   SDHC_TMR_DTDSEL_READ_Val            _U_(0x1)                                             /**< (SDHC_TMR) Read (Card to Host)  */
#define SDHC_TMR_DTDSEL_WRITE                 (SDHC_TMR_DTDSEL_WRITE_Val << SDHC_TMR_DTDSEL_Pos)   /**< (SDHC_TMR) Write (Host to Card) Position  */
#define SDHC_TMR_DTDSEL_READ                  (SDHC_TMR_DTDSEL_READ_Val << SDHC_TMR_DTDSEL_Pos)    /**< (SDHC_TMR) Read (Card to Host) Position  */
#define SDHC_TMR_MSBSEL_Pos                   _U_(5)                                               /**< (SDHC_TMR) Multi/Single Block Selection Position */
#define SDHC_TMR_MSBSEL_Msk                   (_U_(0x1) << SDHC_TMR_MSBSEL_Pos)                    /**< (SDHC_TMR) Multi/Single Block Selection Mask */
#define SDHC_TMR_MSBSEL(value)                (SDHC_TMR_MSBSEL_Msk & ((value) << SDHC_TMR_MSBSEL_Pos))
#define   SDHC_TMR_MSBSEL_SINGLE_Val          _U_(0x0)                                             /**< (SDHC_TMR) Single Block  */
#define   SDHC_TMR_MSBSEL_MULTIPLE_Val        _U_(0x1)                                             /**< (SDHC_TMR) Multiple Block  */
#define SDHC_TMR_MSBSEL_SINGLE                (SDHC_TMR_MSBSEL_SINGLE_Val << SDHC_TMR_MSBSEL_Pos)  /**< (SDHC_TMR) Single Block Position  */
#define SDHC_TMR_MSBSEL_MULTIPLE              (SDHC_TMR_MSBSEL_MULTIPLE_Val << SDHC_TMR_MSBSEL_Pos) /**< (SDHC_TMR) Multiple Block Position  */
#define SDHC_TMR_Msk                          _U_(0x003F)                                          /**< (SDHC_TMR) Register Mask  */


