Microchip-MPLAB-Harmony/reference_apps/apps/sam_e51_cnano/same51n_getting_started/firmware/src/packs/ATSAME51J20A_DFP/component/sdhc.h
/* -------- SDHC_NISTR : (SDHC Offset: 0x30) (R/W 16) Normal Interrupt Status -------- */
#define SDHC_NISTR_RESETVALUE                 _U_(0x00)                                            /**<  (SDHC_NISTR) Normal Interrupt Status  Reset Value */

#define SDHC_NISTR_CMDC_Pos                   _U_(0)                                               /**< (SDHC_NISTR) Command Complete Position */
#define SDHC_NISTR_CMDC_Msk                   (_U_(0x1) << SDHC_NISTR_CMDC_Pos)                    /**< (SDHC_NISTR) Command Complete Mask */
#define SDHC_NISTR_CMDC(value)                (SDHC_NISTR_CMDC_Msk & ((value) << SDHC_NISTR_CMDC_Pos))
#define   SDHC_NISTR_CMDC_NO_Val              _U_(0x0)                                             /**< (SDHC_NISTR) No command complete  */
#define   SDHC_NISTR_CMDC_YES_Val             _U_(0x1)                                             /**< (SDHC_NISTR) Command complete  */
#define SDHC_NISTR_CMDC_NO                    (SDHC_NISTR_CMDC_NO_Val << SDHC_NISTR_CMDC_Pos)      /**< (SDHC_NISTR) No command complete Position  */
#define SDHC_NISTR_CMDC_YES                   (SDHC_NISTR_CMDC_YES_Val << SDHC_NISTR_CMDC_Pos)     /**< (SDHC_NISTR) Command complete Position  */
#define SDHC_NISTR_TRFC_Pos                   _U_(1)                                               /**< (SDHC_NISTR) Transfer Complete Position */
#define SDHC_NISTR_TRFC_Msk                   (_U_(0x1) << SDHC_NISTR_TRFC_Pos)                    /**< (SDHC_NISTR) Transfer Complete Mask */
#define SDHC_NISTR_TRFC(value)                (SDHC_NISTR_TRFC_Msk & ((value) << SDHC_NISTR_TRFC_Pos))
#define   SDHC_NISTR_TRFC_NO_Val              _U_(0x0)                                             /**< (SDHC_NISTR) Not complete  */
#define   SDHC_NISTR_TRFC_YES_Val             _U_(0x1)                                             /**< (SDHC_NISTR) Command execution is completed  */
#define SDHC_NISTR_TRFC_NO                    (SDHC_NISTR_TRFC_NO_Val << SDHC_NISTR_TRFC_Pos)      /**< (SDHC_NISTR) Not complete Position  */
#define SDHC_NISTR_TRFC_YES                   (SDHC_NISTR_TRFC_YES_Val << SDHC_NISTR_TRFC_Pos)     /**< (SDHC_NISTR) Command execution is completed Position  */
#define SDHC_NISTR_BLKGE_Pos                  _U_(2)                                               /**< (SDHC_NISTR) Block Gap Event Position */
#define SDHC_NISTR_BLKGE_Msk                  (_U_(0x1) << SDHC_NISTR_BLKGE_Pos)                   /**< (SDHC_NISTR) Block Gap Event Mask */
#define SDHC_NISTR_BLKGE(value)               (SDHC_NISTR_BLKGE_Msk & ((value) << SDHC_NISTR_BLKGE_Pos))
#define   SDHC_NISTR_BLKGE_NO_Val             _U_(0x0)                                             /**< (SDHC_NISTR) No Block Gap Event  */
#define   SDHC_NISTR_BLKGE_STOP_Val           _U_(0x1)                                             /**< (SDHC_NISTR) Transaction stopped at block gap  */
#define SDHC_NISTR_BLKGE_NO                   (SDHC_NISTR_BLKGE_NO_Val << SDHC_NISTR_BLKGE_Pos)    /**< (SDHC_NISTR) No Block Gap Event Position  */
#define SDHC_NISTR_BLKGE_STOP                 (SDHC_NISTR_BLKGE_STOP_Val << SDHC_NISTR_BLKGE_Pos)  /**< (SDHC_NISTR) Transaction stopped at block gap Position  */
#define SDHC_NISTR_DMAINT_Pos                 _U_(3)                                               /**< (SDHC_NISTR) DMA Interrupt Position */
#define SDHC_NISTR_DMAINT_Msk                 (_U_(0x1) << SDHC_NISTR_DMAINT_Pos)                  /**< (SDHC_NISTR) DMA Interrupt Mask */
#define SDHC_NISTR_DMAINT(value)              (SDHC_NISTR_DMAINT_Msk & ((value) << SDHC_NISTR_DMAINT_Pos))
#define   SDHC_NISTR_DMAINT_NO_Val            _U_(0x0)                                             /**< (SDHC_NISTR) No DMA Interrupt  */
#define   SDHC_NISTR_DMAINT_YES_Val           _U_(0x1)                                             /**< (SDHC_NISTR) DMA Interrupt is generated  */
#define SDHC_NISTR_DMAINT_NO                  (SDHC_NISTR_DMAINT_NO_Val << SDHC_NISTR_DMAINT_Pos)  /**< (SDHC_NISTR) No DMA Interrupt Position  */
#define SDHC_NISTR_DMAINT_YES                 (SDHC_NISTR_DMAINT_YES_Val << SDHC_NISTR_DMAINT_Pos) /**< (SDHC_NISTR) DMA Interrupt is generated Position  */
#define SDHC_NISTR_BWRRDY_Pos                 _U_(4)                                               /**< (SDHC_NISTR) Buffer Write Ready Position */
#define SDHC_NISTR_BWRRDY_Msk                 (_U_(0x1) << SDHC_NISTR_BWRRDY_Pos)                  /**< (SDHC_NISTR) Buffer Write Ready Mask */
#define SDHC_NISTR_BWRRDY(value)              (SDHC_NISTR_BWRRDY_Msk & ((value) << SDHC_NISTR_BWRRDY_Pos))
#define   SDHC_NISTR_BWRRDY_NO_Val            _U_(0x0)                                             /**< (SDHC_NISTR) Not ready to write buffer  */
#define   SDHC_NISTR_BWRRDY_YES_Val           _U_(0x1)                                             /**< (SDHC_NISTR) Ready to write buffer  */
#define SDHC_NISTR_BWRRDY_NO                  (SDHC_NISTR_BWRRDY_NO_Val << SDHC_NISTR_BWRRDY_Pos)  /**< (SDHC_NISTR) Not ready to write buffer Position  */
#define SDHC_NISTR_BWRRDY_YES                 (SDHC_NISTR_BWRRDY_YES_Val << SDHC_NISTR_BWRRDY_Pos) /**< (SDHC_NISTR) Ready to write buffer Position  */
#define SDHC_NISTR_BRDRDY_Pos                 _U_(5)                                               /**< (SDHC_NISTR) Buffer Read Ready Position */
#define SDHC_NISTR_BRDRDY_Msk                 (_U_(0x1) << SDHC_NISTR_BRDRDY_Pos)                  /**< (SDHC_NISTR) Buffer Read Ready Mask */
#define SDHC_NISTR_BRDRDY(value)              (SDHC_NISTR_BRDRDY_Msk & ((value) << SDHC_NISTR_BRDRDY_Pos))
#define   SDHC_NISTR_BRDRDY_NO_Val            _U_(0x0)                                             /**< (SDHC_NISTR) Not ready to read buffer  */
#define   SDHC_NISTR_BRDRDY_YES_Val           _U_(0x1)                                             /**< (SDHC_NISTR) Ready to read buffer  */
#define SDHC_NISTR_BRDRDY_NO                  (SDHC_NISTR_BRDRDY_NO_Val << SDHC_NISTR_BRDRDY_Pos)  /**< (SDHC_NISTR) Not ready to read buffer Position  */
#define SDHC_NISTR_BRDRDY_YES                 (SDHC_NISTR_BRDRDY_YES_Val << SDHC_NISTR_BRDRDY_Pos) /**< (SDHC_NISTR) Ready to read buffer Position  */
#define SDHC_NISTR_CINS_Pos                   _U_(6)                                               /**< (SDHC_NISTR) Card Insertion Position */
#define SDHC_NISTR_CINS_Msk                   (_U_(0x1) << SDHC_NISTR_CINS_Pos)                    /**< (SDHC_NISTR) Card Insertion Mask */
#define SDHC_NISTR_CINS(value)                (SDHC_NISTR_CINS_Msk & ((value) << SDHC_NISTR_CINS_Pos))
#define   SDHC_NISTR_CINS_NO_Val              _U_(0x0)                                             /**< (SDHC_NISTR) Card state stable or Debouncing  */
#define   SDHC_NISTR_CINS_YES_Val             _U_(0x1)                                             /**< (SDHC_NISTR) Card inserted  */
#define SDHC_NISTR_CINS_NO                    (SDHC_NISTR_CINS_NO_Val << SDHC_NISTR_CINS_Pos)      /**< (SDHC_NISTR) Card state stable or Debouncing Position  */
#define SDHC_NISTR_CINS_YES                   (SDHC_NISTR_CINS_YES_Val << SDHC_NISTR_CINS_Pos)     /**< (SDHC_NISTR) Card inserted Position  */
#define SDHC_NISTR_CREM_Pos                   _U_(7)                                               /**< (SDHC_NISTR) Card Removal Position */
#define SDHC_NISTR_CREM_Msk                   (_U_(0x1) << SDHC_NISTR_CREM_Pos)                    /**< (SDHC_NISTR) Card Removal Mask */
#define SDHC_NISTR_CREM(value)                (SDHC_NISTR_CREM_Msk & ((value) << SDHC_NISTR_CREM_Pos))
#define   SDHC_NISTR_CREM_NO_Val              _U_(0x0)                                             /**< (SDHC_NISTR) Card state stable or Debouncing  */
#define   SDHC_NISTR_CREM_YES_Val             _U_(0x1)                                             /**< (SDHC_NISTR) Card Removed  */
#define SDHC_NISTR_CREM_NO                    (SDHC_NISTR_CREM_NO_Val << SDHC_NISTR_CREM_Pos)      /**< (SDHC_NISTR) Card state stable or Debouncing Position  */
#define SDHC_NISTR_CREM_YES                   (SDHC_NISTR_CREM_YES_Val << SDHC_NISTR_CREM_Pos)     /**< (SDHC_NISTR) Card Removed Position  */
#define SDHC_NISTR_CINT_Pos                   _U_(8)                                               /**< (SDHC_NISTR) Card Interrupt Position */
#define SDHC_NISTR_CINT_Msk                   (_U_(0x1) << SDHC_NISTR_CINT_Pos)                    /**< (SDHC_NISTR) Card Interrupt Mask */
#define SDHC_NISTR_CINT(value)                (SDHC_NISTR_CINT_Msk & ((value) << SDHC_NISTR_CINT_Pos))
#define   SDHC_NISTR_CINT_NO_Val              _U_(0x0)                                             /**< (SDHC_NISTR) No Card Interrupt  */
#define   SDHC_NISTR_CINT_YES_Val             _U_(0x1)                                             /**< (SDHC_NISTR) Generate Card Interrupt  */
#define SDHC_NISTR_CINT_NO                    (SDHC_NISTR_CINT_NO_Val << SDHC_NISTR_CINT_Pos)      /**< (SDHC_NISTR) No Card Interrupt Position  */
#define SDHC_NISTR_CINT_YES                   (SDHC_NISTR_CINT_YES_Val << SDHC_NISTR_CINT_Pos)     /**< (SDHC_NISTR) Generate Card Interrupt Position  */
#define SDHC_NISTR_ERRINT_Pos                 _U_(15)                                              /**< (SDHC_NISTR) Error Interrupt Position */
#define SDHC_NISTR_ERRINT_Msk                 (_U_(0x1) << SDHC_NISTR_ERRINT_Pos)                  /**< (SDHC_NISTR) Error Interrupt Mask */
#define SDHC_NISTR_ERRINT(value)              (SDHC_NISTR_ERRINT_Msk & ((value) << SDHC_NISTR_ERRINT_Pos))
#define   SDHC_NISTR_ERRINT_NO_Val            _U_(0x0)                                             /**< (SDHC_NISTR) No Error  */
#define   SDHC_NISTR_ERRINT_YES_Val           _U_(0x1)                                             /**< (SDHC_NISTR) Error  */
#define SDHC_NISTR_ERRINT_NO                  (SDHC_NISTR_ERRINT_NO_Val << SDHC_NISTR_ERRINT_Pos)  /**< (SDHC_NISTR) No Error Position  */
#define SDHC_NISTR_ERRINT_YES                 (SDHC_NISTR_ERRINT_YES_Val << SDHC_NISTR_ERRINT_Pos) /**< (SDHC_NISTR) Error Position  */
#define SDHC_NISTR_Msk                        _U_(0x81FF)                                          /**< (SDHC_NISTR) Register Mask  */

/* EMMC mode */
#define SDHC_NISTR_EMMC_BOOTAR_Pos            _U_(14)                                              /**< (SDHC_NISTR) Boot Acknowledge Received Position */
#define SDHC_NISTR_EMMC_BOOTAR_Msk            (_U_(0x1) << SDHC_NISTR_EMMC_BOOTAR_Pos)             /**< (SDHC_NISTR) Boot Acknowledge Received Mask */
#define SDHC_NISTR_EMMC_BOOTAR(value)         (SDHC_NISTR_EMMC_BOOTAR_Msk & ((value) << SDHC_NISTR_EMMC_BOOTAR_Pos))
#define SDHC_NISTR_EMMC_Msk                   _U_(0x4000)                                           /**< (SDHC_NISTR_EMMC) Register Mask  */


