Microchip-MPLAB-Harmony/reference_apps/apps/sam_e51_cnano/same51n_getting_started/firmware/src/packs/ATSAME51J20A_DFP/component/sdhc.h
#define SDHC_CA0R_TEOCLKF_Pos                 _U_(0)                                               /**< (SDHC_CA0R) Timeout Clock Frequency Position */
#define SDHC_CA0R_TEOCLKF_Msk                 (_U_(0x3F) << SDHC_CA0R_TEOCLKF_Pos)                 /**< (SDHC_CA0R) Timeout Clock Frequency Mask */
#define SDHC_CA0R_TEOCLKF(value)              (SDHC_CA0R_TEOCLKF_Msk & ((value) << SDHC_CA0R_TEOCLKF_Pos))
#define   SDHC_CA0R_TEOCLKF_OTHER_Val         _U_(0x0)                                             /**< (SDHC_CA0R) Get information via another method  */
#define SDHC_CA0R_TEOCLKF_OTHER               (SDHC_CA0R_TEOCLKF_OTHER_Val << SDHC_CA0R_TEOCLKF_Pos) /**< (SDHC_CA0R) Get information via another method Position  */
#define SDHC_CA0R_TEOCLKU_Pos                 _U_(7)                                               /**< (SDHC_CA0R) Timeout Clock Unit Position */
#define SDHC_CA0R_TEOCLKU_Msk                 (_U_(0x1) << SDHC_CA0R_TEOCLKU_Pos)                  /**< (SDHC_CA0R) Timeout Clock Unit Mask */
#define SDHC_CA0R_TEOCLKU(value)              (SDHC_CA0R_TEOCLKU_Msk & ((value) << SDHC_CA0R_TEOCLKU_Pos))
#define   SDHC_CA0R_TEOCLKU_KHZ_Val           _U_(0x0)                                             /**< (SDHC_CA0R) KHz  */
#define   SDHC_CA0R_TEOCLKU_MHZ_Val           _U_(0x1)                                             /**< (SDHC_CA0R) MHz  */
#define SDHC_CA0R_TEOCLKU_KHZ                 (SDHC_CA0R_TEOCLKU_KHZ_Val << SDHC_CA0R_TEOCLKU_Pos) /**< (SDHC_CA0R) KHz Position  */
#define SDHC_CA0R_TEOCLKU_MHZ                 (SDHC_CA0R_TEOCLKU_MHZ_Val << SDHC_CA0R_TEOCLKU_Pos) /**< (SDHC_CA0R) MHz Position  */
#define SDHC_CA0R_BASECLKF_Pos                _U_(8)                                               /**< (SDHC_CA0R) Base Clock Frequency Position */
#define SDHC_CA0R_BASECLKF_Msk                (_U_(0xFF) << SDHC_CA0R_BASECLKF_Pos)                /**< (SDHC_CA0R) Base Clock Frequency Mask */
#define SDHC_CA0R_BASECLKF(value)             (SDHC_CA0R_BASECLKF_Msk & ((value) << SDHC_CA0R_BASECLKF_Pos))
#define   SDHC_CA0R_BASECLKF_OTHER_Val        _U_(0x0)                                             /**< (SDHC_CA0R) Get information via another method  */
#define SDHC_CA0R_BASECLKF_OTHER              (SDHC_CA0R_BASECLKF_OTHER_Val << SDHC_CA0R_BASECLKF_Pos) /**< (SDHC_CA0R) Get information via another method Position  */
#define SDHC_CA0R_MAXBLKL_Pos                 _U_(16)                                              /**< (SDHC_CA0R) Max Block Length Position */
#define SDHC_CA0R_MAXBLKL_Msk                 (_U_(0x3) << SDHC_CA0R_MAXBLKL_Pos)                  /**< (SDHC_CA0R) Max Block Length Mask */
#define SDHC_CA0R_MAXBLKL(value)              (SDHC_CA0R_MAXBLKL_Msk & ((value) << SDHC_CA0R_MAXBLKL_Pos))
#define   SDHC_CA0R_MAXBLKL_512_Val           _U_(0x0)                                             /**< (SDHC_CA0R) 512 bytes  */
#define   SDHC_CA0R_MAXBLKL_1024_Val          _U_(0x1)                                             /**< (SDHC_CA0R) 1024 bytes  */
#define   SDHC_CA0R_MAXBLKL_2048_Val          _U_(0x2)                                             /**< (SDHC_CA0R) 2048 bytes  */
#define SDHC_CA0R_MAXBLKL_512                 (SDHC_CA0R_MAXBLKL_512_Val << SDHC_CA0R_MAXBLKL_Pos) /**< (SDHC_CA0R) 512 bytes Position  */
#define SDHC_CA0R_MAXBLKL_1024                (SDHC_CA0R_MAXBLKL_1024_Val << SDHC_CA0R_MAXBLKL_Pos) /**< (SDHC_CA0R) 1024 bytes Position  */
#define SDHC_CA0R_MAXBLKL_2048                (SDHC_CA0R_MAXBLKL_2048_Val << SDHC_CA0R_MAXBLKL_Pos) /**< (SDHC_CA0R) 2048 bytes Position  */
#define SDHC_CA0R_ED8SUP_Pos                  _U_(18)                                              /**< (SDHC_CA0R) 8-bit Support for Embedded Device Position */
#define SDHC_CA0R_ED8SUP_Msk                  (_U_(0x1) << SDHC_CA0R_ED8SUP_Pos)                   /**< (SDHC_CA0R) 8-bit Support for Embedded Device Mask */
#define SDHC_CA0R_ED8SUP(value)               (SDHC_CA0R_ED8SUP_Msk & ((value) << SDHC_CA0R_ED8SUP_Pos))
#define   SDHC_CA0R_ED8SUP_NO_Val             _U_(0x0)                                             /**< (SDHC_CA0R) 8-bit Bus Width not Supported  */
#define   SDHC_CA0R_ED8SUP_YES_Val            _U_(0x1)                                             /**< (SDHC_CA0R) 8-bit Bus Width Supported  */
#define SDHC_CA0R_ED8SUP_NO                   (SDHC_CA0R_ED8SUP_NO_Val << SDHC_CA0R_ED8SUP_Pos)    /**< (SDHC_CA0R) 8-bit Bus Width not Supported Position  */
#define SDHC_CA0R_ED8SUP_YES                  (SDHC_CA0R_ED8SUP_YES_Val << SDHC_CA0R_ED8SUP_Pos)   /**< (SDHC_CA0R) 8-bit Bus Width Supported Position  */
#define SDHC_CA0R_ADMA2SUP_Pos                _U_(19)                                              /**< (SDHC_CA0R) ADMA2 Support Position */
#define SDHC_CA0R_ADMA2SUP_Msk                (_U_(0x1) << SDHC_CA0R_ADMA2SUP_Pos)                 /**< (SDHC_CA0R) ADMA2 Support Mask */
#define SDHC_CA0R_ADMA2SUP(value)             (SDHC_CA0R_ADMA2SUP_Msk & ((value) << SDHC_CA0R_ADMA2SUP_Pos))
#define   SDHC_CA0R_ADMA2SUP_NO_Val           _U_(0x0)                                             /**< (SDHC_CA0R) ADMA2 not Supported  */
#define   SDHC_CA0R_ADMA2SUP_YES_Val          _U_(0x1)                                             /**< (SDHC_CA0R) ADMA2 Supported  */
#define SDHC_CA0R_ADMA2SUP_NO                 (SDHC_CA0R_ADMA2SUP_NO_Val << SDHC_CA0R_ADMA2SUP_Pos) /**< (SDHC_CA0R) ADMA2 not Supported Position  */
#define SDHC_CA0R_ADMA2SUP_YES                (SDHC_CA0R_ADMA2SUP_YES_Val << SDHC_CA0R_ADMA2SUP_Pos) /**< (SDHC_CA0R) ADMA2 Supported Position  */
#define SDHC_CA0R_HSSUP_Pos                   _U_(21)                                              /**< (SDHC_CA0R) High Speed Support Position */
#define SDHC_CA0R_HSSUP_Msk                   (_U_(0x1) << SDHC_CA0R_HSSUP_Pos)                    /**< (SDHC_CA0R) High Speed Support Mask */
#define SDHC_CA0R_HSSUP(value)                (SDHC_CA0R_HSSUP_Msk & ((value) << SDHC_CA0R_HSSUP_Pos))
#define   SDHC_CA0R_HSSUP_NO_Val              _U_(0x0)                                             /**< (SDHC_CA0R) High Speed not Supported  */
#define   SDHC_CA0R_HSSUP_YES_Val             _U_(0x1)                                             /**< (SDHC_CA0R) High Speed Supported  */
#define SDHC_CA0R_HSSUP_NO                    (SDHC_CA0R_HSSUP_NO_Val << SDHC_CA0R_HSSUP_Pos)      /**< (SDHC_CA0R) High Speed not Supported Position  */
#define SDHC_CA0R_HSSUP_YES                   (SDHC_CA0R_HSSUP_YES_Val << SDHC_CA0R_HSSUP_Pos)     /**< (SDHC_CA0R) High Speed Supported Position  */
#define SDHC_CA0R_SDMASUP_Pos                 _U_(22)                                              /**< (SDHC_CA0R) SDMA Support Position */
#define SDHC_CA0R_SDMASUP_Msk                 (_U_(0x1) << SDHC_CA0R_SDMASUP_Pos)                  /**< (SDHC_CA0R) SDMA Support Mask */
#define SDHC_CA0R_SDMASUP(value)              (SDHC_CA0R_SDMASUP_Msk & ((value) << SDHC_CA0R_SDMASUP_Pos))
#define   SDHC_CA0R_SDMASUP_NO_Val            _U_(0x0)                                             /**< (SDHC_CA0R) SDMA not Supported  */
#define   SDHC_CA0R_SDMASUP_YES_Val           _U_(0x1)                                             /**< (SDHC_CA0R) SDMA Supported  */
#define SDHC_CA0R_SDMASUP_NO                  (SDHC_CA0R_SDMASUP_NO_Val << SDHC_CA0R_SDMASUP_Pos)  /**< (SDHC_CA0R) SDMA not Supported Position  */
#define SDHC_CA0R_SDMASUP_YES                 (SDHC_CA0R_SDMASUP_YES_Val << SDHC_CA0R_SDMASUP_Pos) /**< (SDHC_CA0R) SDMA Supported Position  */
#define SDHC_CA0R_SRSUP_Pos                   _U_(23)                                              /**< (SDHC_CA0R) Suspend/Resume Support Position */
#define SDHC_CA0R_SRSUP_Msk                   (_U_(0x1) << SDHC_CA0R_SRSUP_Pos)                    /**< (SDHC_CA0R) Suspend/Resume Support Mask */
#define SDHC_CA0R_SRSUP(value)                (SDHC_CA0R_SRSUP_Msk & ((value) << SDHC_CA0R_SRSUP_Pos))
#define   SDHC_CA0R_SRSUP_NO_Val              _U_(0x0)                                             /**< (SDHC_CA0R) Suspend/Resume not Supported  */
#define   SDHC_CA0R_SRSUP_YES_Val             _U_(0x1)                                             /**< (SDHC_CA0R) Suspend/Resume Supported  */
#define SDHC_CA0R_SRSUP_NO                    (SDHC_CA0R_SRSUP_NO_Val << SDHC_CA0R_SRSUP_Pos)      /**< (SDHC_CA0R) Suspend/Resume not Supported Position  */
#define SDHC_CA0R_SRSUP_YES                   (SDHC_CA0R_SRSUP_YES_Val << SDHC_CA0R_SRSUP_Pos)     /**< (SDHC_CA0R) Suspend/Resume Supported Position  */
#define SDHC_CA0R_V33VSUP_Pos                 _U_(24)                                              /**< (SDHC_CA0R) Voltage Support 3.3V Position */
#define SDHC_CA0R_V33VSUP_Msk                 (_U_(0x1) << SDHC_CA0R_V33VSUP_Pos)                  /**< (SDHC_CA0R) Voltage Support 3.3V Mask */
#define SDHC_CA0R_V33VSUP(value)              (SDHC_CA0R_V33VSUP_Msk & ((value) << SDHC_CA0R_V33VSUP_Pos))
#define   SDHC_CA0R_V33VSUP_NO_Val            _U_(0x0)                                             /**< (SDHC_CA0R) 3.3V Not Supported  */
#define   SDHC_CA0R_V33VSUP_YES_Val           _U_(0x1)                                             /**< (SDHC_CA0R) 3.3V Supported  */
#define SDHC_CA0R_V33VSUP_NO                  (SDHC_CA0R_V33VSUP_NO_Val << SDHC_CA0R_V33VSUP_Pos)  /**< (SDHC_CA0R) 3.3V Not Supported Position  */
#define SDHC_CA0R_V33VSUP_YES                 (SDHC_CA0R_V33VSUP_YES_Val << SDHC_CA0R_V33VSUP_Pos) /**< (SDHC_CA0R) 3.3V Supported Position  */
#define SDHC_CA0R_V30VSUP_Pos                 _U_(25)                                              /**< (SDHC_CA0R) Voltage Support 3.0V Position */
#define SDHC_CA0R_V30VSUP_Msk                 (_U_(0x1) << SDHC_CA0R_V30VSUP_Pos)                  /**< (SDHC_CA0R) Voltage Support 3.0V Mask */
#define SDHC_CA0R_V30VSUP(value)              (SDHC_CA0R_V30VSUP_Msk & ((value) << SDHC_CA0R_V30VSUP_Pos))
#define   SDHC_CA0R_V30VSUP_NO_Val            _U_(0x0)                                             /**< (SDHC_CA0R) 3.0V Not Supported  */
#define   SDHC_CA0R_V30VSUP_YES_Val           _U_(0x1)                                             /**< (SDHC_CA0R) 3.0V Supported  */
#define SDHC_CA0R_V30VSUP_NO                  (SDHC_CA0R_V30VSUP_NO_Val << SDHC_CA0R_V30VSUP_Pos)  /**< (SDHC_CA0R) 3.0V Not Supported Position  */
#define SDHC_CA0R_V30VSUP_YES                 (SDHC_CA0R_V30VSUP_YES_Val << SDHC_CA0R_V30VSUP_Pos) /**< (SDHC_CA0R) 3.0V Supported Position  */
#define SDHC_CA0R_V18VSUP_Pos                 _U_(26)                                              /**< (SDHC_CA0R) Voltage Support 1.8V Position */
#define SDHC_CA0R_V18VSUP_Msk                 (_U_(0x1) << SDHC_CA0R_V18VSUP_Pos)                  /**< (SDHC_CA0R) Voltage Support 1.8V Mask */
#define SDHC_CA0R_V18VSUP(value)              (SDHC_CA0R_V18VSUP_Msk & ((value) << SDHC_CA0R_V18VSUP_Pos))
#define   SDHC_CA0R_V18VSUP_NO_Val            _U_(0x0)                                             /**< (SDHC_CA0R) 1.8V Not Supported  */
#define   SDHC_CA0R_V18VSUP_YES_Val           _U_(0x1)                                             /**< (SDHC_CA0R) 1.8V Supported  */
#define SDHC_CA0R_V18VSUP_NO                  (SDHC_CA0R_V18VSUP_NO_Val << SDHC_CA0R_V18VSUP_Pos)  /**< (SDHC_CA0R) 1.8V Not Supported Position  */
#define SDHC_CA0R_V18VSUP_YES                 (SDHC_CA0R_V18VSUP_YES_Val << SDHC_CA0R_V18VSUP_Pos) /**< (SDHC_CA0R) 1.8V Supported Position  */
#define SDHC_CA0R_SB64SUP_Pos                 _U_(28)                                              /**< (SDHC_CA0R) 64-Bit System Bus Support Position */
#define SDHC_CA0R_SB64SUP_Msk                 (_U_(0x1) << SDHC_CA0R_SB64SUP_Pos)                  /**< (SDHC_CA0R) 64-Bit System Bus Support Mask */
#define SDHC_CA0R_SB64SUP(value)              (SDHC_CA0R_SB64SUP_Msk & ((value) << SDHC_CA0R_SB64SUP_Pos))
#define   SDHC_CA0R_SB64SUP_NO_Val            _U_(0x0)                                             /**< (SDHC_CA0R) 32-bit Address Descriptors and System Bus  */
#define   SDHC_CA0R_SB64SUP_YES_Val           _U_(0x1)                                             /**< (SDHC_CA0R) 64-bit Address Descriptors and System Bus  */
#define SDHC_CA0R_SB64SUP_NO                  (SDHC_CA0R_SB64SUP_NO_Val << SDHC_CA0R_SB64SUP_Pos)  /**< (SDHC_CA0R) 32-bit Address Descriptors and System Bus Position  */
#define SDHC_CA0R_SB64SUP_YES                 (SDHC_CA0R_SB64SUP_YES_Val << SDHC_CA0R_SB64SUP_Pos) /**< (SDHC_CA0R) 64-bit Address Descriptors and System Bus Position  */
#define SDHC_CA0R_ASINTSUP_Pos                _U_(29)                                              /**< (SDHC_CA0R) Asynchronous Interrupt Support Position */
#define SDHC_CA0R_ASINTSUP_Msk                (_U_(0x1) << SDHC_CA0R_ASINTSUP_Pos)                 /**< (SDHC_CA0R) Asynchronous Interrupt Support Mask */
#define SDHC_CA0R_ASINTSUP(value)             (SDHC_CA0R_ASINTSUP_Msk & ((value) << SDHC_CA0R_ASINTSUP_Pos))
#define   SDHC_CA0R_ASINTSUP_NO_Val           _U_(0x0)                                             /**< (SDHC_CA0R) Asynchronous Interrupt not Supported  */
#define   SDHC_CA0R_ASINTSUP_YES_Val          _U_(0x1)                                             /**< (SDHC_CA0R) Asynchronous Interrupt supported  */
#define SDHC_CA0R_ASINTSUP_NO                 (SDHC_CA0R_ASINTSUP_NO_Val << SDHC_CA0R_ASINTSUP_Pos) /**< (SDHC_CA0R) Asynchronous Interrupt not Supported Position  */
#define SDHC_CA0R_ASINTSUP_YES                (SDHC_CA0R_ASINTSUP_YES_Val << SDHC_CA0R_ASINTSUP_Pos) /**< (SDHC_CA0R) Asynchronous Interrupt supported Position  */
#define SDHC_CA0R_SLTYPE_Pos                  _U_(30)                                              /**< (SDHC_CA0R) Slot Type Position */
#define SDHC_CA0R_SLTYPE_Msk                  (_U_(0x3) << SDHC_CA0R_SLTYPE_Pos)                   /**< (SDHC_CA0R) Slot Type Mask */
#define SDHC_CA0R_SLTYPE(value)               (SDHC_CA0R_SLTYPE_Msk & ((value) << SDHC_CA0R_SLTYPE_Pos))
#define   SDHC_CA0R_SLTYPE_REMOVABLE_Val      _U_(0x0)                                             /**< (SDHC_CA0R) Removable Card Slot  */
#define   SDHC_CA0R_SLTYPE_EMBEDDED_Val       _U_(0x1)                                             /**< (SDHC_CA0R) Embedded Slot for One Device  */
#define SDHC_CA0R_SLTYPE_REMOVABLE            (SDHC_CA0R_SLTYPE_REMOVABLE_Val << SDHC_CA0R_SLTYPE_Pos) /**< (SDHC_CA0R) Removable Card Slot Position  */
#define SDHC_CA0R_SLTYPE_EMBEDDED             (SDHC_CA0R_SLTYPE_EMBEDDED_Val << SDHC_CA0R_SLTYPE_Pos) /**< (SDHC_CA0R) Embedded Slot for One Device Position  */
#define SDHC_CA0R_Msk                         _U_(0xF7EFFFBF)                                      /**< (SDHC_CA0R) Register Mask  */


/* -------- SDHC_CA1R : (SDHC Offset: 0x44) ( R/ 32) Capabilities 1 -------- */
#define SDHC_CA1R_RESETVALUE                  _U_(0x70)                                            /**<  (SDHC_CA1R) Capabilities 1  Reset Value */

